# Data preprocessing(Fill null data, Categorization, Changing string to number, one-hot encoding, Dropping unneeded data)

In [1]:
## Import modules

In [2]:
import numpy as np
import pandas as pd
from pandas import Series
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.offline as py
py.init_notebook_mode(connected=True)
import plotly.graph_objs as go
import plotly.tools as tls

#ignore warnings
import warnings

%matplotlib inline

Import file(Should put 'r' in front to avoid SyntaxError)

In [3]:
df_train=pd.read_csv(r'C:\Users\user\Desktop\데이터분석\220203 프로젝트1_titanic\train.csv')
df_test=pd.read_csv(r'C:\Users\user\Desktop\데이터분석\220203 프로젝트1_titanic\test.csv')

Create 'FamilySize' column

In [4]:
df_train['FamilySize']=df_train['SibSp']+df_train['Parch']+1
df_test['FamilySize']=df_test['SibSp']+df_test['Parch']+1
#Why do I put 1? 'Because Sibsp, Parch does not include the passenger himself. SibSp' refers the number of sibling+spouse the passenger aboarded wih.'SibSp' refers the number of parents and chold the passenger aboarded wih

Create not skewed fare model for correct machine learning

Fill the Fare data with not skewed data

In [8]:
df_train['Fare'] = df_train['Fare'].map(lambda i: np.log(i) if i > 0 else 0)
df_test['Fare'] = df_test['Fare'].map(lambda i: np.log(i) if i > 0 else 0)
#use of 'lambda' to log the outliers

### Fill null data

In [9]:
df_train['Title']=df_train['Name'].str.extract('([A-Za-z]+)\.')
df_test['Title']=df_test['Name'].str.extract('([A-Za-z]+)\.')

In [10]:
df_train['Title'].replace(['Capt', 'Col', 'Countess', 'Don', 'Dr', 'Jonkheer', 'Lady', 'Major', 'Miss', 'Mlle', 'Mme', 'Mr', 'Mrs', 'Ms', 'Rev', 'Sir'],
                         ['Mr', 'Mr', 'Mrs', 'Mr', 'Mr', 'Other', 'Miss', 'Mr', 'Miss', 'Miss', 'Miss', 'Mr', 'Mrs', 'Miss', 'Mr', 'Mr'], inplace=True)
df_test['Title'].replace(['Capt', 'Col', 'Countess', 'Don', 'Dr', 'Jonkheer', 'Lady', 'Major', 'Miss', 'Mlle', 'Mme', 'Mr', 'Mrs', 'Ms', 'Rev', 'Sir', 'Dona'],
                         ['Mr', 'Mr', 'Mrs', 'Mr', 'Mr', 'Other', 'Miss', 'Mr', 'Miss', 'Miss', 'Miss', 'Mr', 'Mrs', 'Miss', 'Mr', 'Mr', 'Mrs'], inplace=True)

In [11]:
df_all=pd.concat([df_train, df_test])

In [12]:
df_train.loc[(df_train['Age'].isnull())&(df_train['Title']=='Mr'), 'Age']=33
df_train.loc[(df_train['Age'].isnull())&(df_train['Title']=='Mrs'), 'Age']=37
df_train.loc[(df_train['Age'].isnull())&(df_train['Title']=='Master'), 'Age']=5
df_train.loc[(df_train['Age'].isnull())&(df_train['Title']=='Miss'), 'Age']=22
df_train.loc[(df_train['Age'].isnull())&(df_train['Title']=='Other'), 'Age']=45

In [13]:
df_test.loc[(df_test['Age'].isnull())&(df_test['Title']=='Mr'), 'Age']=33
df_test.loc[(df_test['Age'].isnull())&(df_test['Title']=='Mrs'), 'Age']=37
df_test.loc[(df_test['Age'].isnull())&(df_test['Title']=='Master'), 'Age']=5
df_test.loc[(df_test['Age'].isnull())&(df_test['Title']=='Miss'), 'Age']=22
df_test.loc[(df_test['Age'].isnull())&(df_test['Title']=='Other'), 'Age']=45

In [14]:
df_train['Embarked'].fillna('S', inplace=True)

### Categorizing 'Age'

Make a new column that categorize age groups by ten years.

In [15]:
def category_age(x):
    return min(int(x / 10), 7)

In [16]:
df_train['Age_2']=df_train['Age'].apply(category_age)

df_test['Age_2']=df_test['Age'].apply(category_age)

Delete 'Age' column since I made the 'Age_2' column

In [18]:
df_train.drop(['Age'], axis=1, inplace=True)
#'axis=1' means deleting the column(세로줄)

In [19]:
df_test.drop(['Age'], axis=1, inplace=True)

### Changing 'Title' into number

In [20]:
df_train['Title']=df_train['Title'].map({'Master':0, 'Miss':1, 'Mr':2, 'Mrs':3, 'Other':4})
df_test['Title']=df_test['Title'].map({'Master':0, 'Miss':1, 'Mr':2, 'Mrs':3, 'Other':4})

### Changing 'Embarked' into number

In [140]:
df_train['Embarked']=df_train['Embarked'].map({'C':0, 'Q':1, 'S':2})
df_test['Embarked']=df_test['Embarked'].map({'C':0, 'Q':1, 'S':2})

### Changing 'Sex' into number

In [21]:
df_train['Sex']=df_train['Sex'].map({'female':0, 'male':1})
df_test['Sex']=df_test['Sex'].map({'female':0, 'male':1})

## One-hot encoding on Initial and Embarked

In [29]:
df_train=pd.get_dummies(df_train, columns=['Title'], prefix='Title')
df_test=pd.get_dummies(df_test, columns=['Title'], prefix='Title')

In [31]:
df_train=pd.get_dummies(df_train, columns=['Embarked'], prefix='Embarked')
df_test=pd.get_dummies(df_test, columns=['Embarked'], prefix='Embarked')

In [38]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,FamilySize,Age_2,Title_0,Title_1,Title_2,Title_3,Title_4,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",1,1,0,A/5 21171,1.981001,NaN,2,2,0,0,1,0,0,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,0,PC 17599,4.266662,C85,2,3,0,0,0,1,0,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",0,0,0,STON/O2. 3101282,2.070022,NaN,1,2,0,1,0,0,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,0,113803,3.972177,C123,2,3,0,0,0,1,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",1,0,0,373450,2.085672,NaN,1,3,0,0,1,0,0,0,0,1

## Dropping un-needed columns(string column)

In [39]:
df_train.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [42]:
df_test.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [45]:
df_test.head()

,Pclass,Sex,Fare,FamilySize,Age_2,Title_0,Title_1,Title_2,Title_3,Embarked_C,Embarked_Q,Embarked_S
0,3,1,2.057860,1,3,0,0,1,0,0,1,0
1,3,0,1.945910,2,4,0,0,0,1,0,0,1
2,2,1,2.270836,1,6,0,0,1,0,0,1,0
3,3,1,2.159003,1,2,0,0,1,0,0,0,1
4,3,0,2.508582,3,2,0,0,0,1,0,0,1